# ModelOrSymbolic Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ModelOrSymbolic Property
ParameterTypeId Class See Also
---
"Model or Symbolic"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ModelOrSymbolic { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ModelOrSymbolic As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ModelOrSymbolic {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace